Revit 2026 API

# StructuralConnectionHandlerTypeCreate(Document, String, Guid, String, ElementId, IListConnectionInputPointInfo) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static StructuralConnectionHandlerType Create(
	Document pADoc,
	string name,
	Guid guid,
	string familyName,
	ElementId categoryId,
	IList<ConnectionInputPointInfo> inputPointsInfo
)
```
```vb
Public Shared Function Create (
	pADoc As Document,
	name As String,
	guid As Guid,
	familyName As String,
	categoryId As ElementId,
	inputPointsInfo As IList(Of ConnectionInputPointInfo)
) As StructuralConnectionHandlerType
```
```cpp
public:
static StructuralConnectionHandlerType^ Create(
	Document^ pADoc,
	String^ name,
	Guid guid,
	String^ familyName,
	ElementId^ categoryId,
	IList<ConnectionInputPointInfo^>^ inputPointsInfo
)
```
```fsharp
static member Create :
        pADoc : Document *
        name : string *
        guid : Guid *
        familyName : string *
        categoryId : ElementId *
        inputPointsInfo : IList<ConnectionInputPointInfo> -> StructuralConnectionHandlerType
```

#### Parameters

pADoc Document

name String

guid Guid

familyName String

categoryId ElementId

inputPointsInfo IListConnectionInputPointInfo

#### Return Value

StructuralConnectionHandlerType

#### Reference

StructuralConnectionHandlerType Class

Create Overload

Autodesk.Revit.DB.Structure Namespace